Revit 2026 API

# RenderingSettingsGetRenderingRegionOutline Method

---

Returns the outline of the rendering region.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Outline GetRenderingRegionOutline()
```
```vb
Public Function GetRenderingRegionOutline As Outline
```
```cpp
public:
Outline^ GetRenderingRegionOutline()
```
```fsharp
member GetRenderingRegionOutline : unit -> Outline
```

#### Return Value

Outline The outline of the rendering region.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The RenderingSettings are not currently using region rendering. |

#### Reference

RenderingSettings Class

Autodesk.Revit.DB Namespace